#!/usr/bin/python
# -*- coding: utf8 -*-
import re

eow = r'(^|$|[ \n\t,.!;:«»„“\(\[\{\)\]\}—–-])'
# замены для расшифровки титл в кодировке UTF
utf_untitlo = { \
'гг҃л' : 'нгел', \
'пⷭ҇л' : 'по́стол', \
'пⷭ҇тол' : 'по́стол', \
'пⷭ҇тѡл' : 'по́стѡл', \
'пⷭ҇кп' : 'пи́скоп', \
'пⷭ҇коп' : 'пи́скоп', \
'гг҃єл' : 'нгєл', \
'бг҃а' + eow : r'Бо́га\1', \
'бг҃ови' + eow : r'Бо́гови\1', \
eow + 'бг҃ома́т' : r'\1Богома́т', \
eow + 'бг҃омлад' : r'\1Богомлад', \
eow + 'бг҃омт҃' : r'\1Богома́т', \
'бг҃ом' : 'бо́гом', \
eow + 'бг҃оро́д' : r'\1Богоро́д', \
eow + 'бг҃ꙋ' + eow : r'\1Бо́гу\2', \
eow + 'бг҃ъ' : r'\1Бо́гъ', \
'бг҃' : 'бог', \
'Бг҃' : 'Бог', \
eow + 'бж҃е' + eow : r'\1Бо́же\2', \
'бж҃е' : 'боже', \
'Бж҃е' : 'Боже', \
'бж҃ї' : 'бо́жї', \
'Бж҃ї' : 'Бо́жї', \
'бжⷭ҇т' : 'боже́ст', \
'Бжⷭ҇т' : 'Боже́ст', \
'бз҃и' : 'бози', \
'Бз҃и' : 'Бози', \
eow + 'бз҃ѣ' : r'\1Бозѣ', \
'бз҃ѣ' : 'бозѣ', \
'Бз҃ѣ' : 'Бозѣ', \
'блгⷣт' : 'благода́т', \
'Блгⷣт' : 'Благода́т', \
'блгⷭ҇в' : 'благослов', \
'Блгⷭ҇в' : 'Благослов', \
eow + 'бл҃га' + eow : r'\1бла́га\2', \
eow + 'бл҃ги' + eow : r'\1бла́ги\2', \
eow + 'бл҃го' + eow : r'\1бла́го\2', \
eow + 'бл҃гъ' + eow : r'\1бла́гъ\2', \
'бл҃г' : 'благ', \
'Бл҃г' : 'Благ', \
'бл҃ж' : 'блаж', \
'Бл҃ж' : 'Блаж', \
'бл҃з' : 'блаз', \
'Бл҃з' : 'Блаз', \
eow + 'бцⷣ' : r'\1Богоро́диц', \
'бцⷣ' : 'богоро́диц', \
'Бцⷣ' : 'Богоро́диц', \
'бчⷣ' : 'богоро́дич', \
'Бчⷣ' : 'Богоро́дич', \
eow + 'влⷣк' : r'\1Влады́к', \
'влⷣк' : 'влады́к', \
'Влⷣк' : 'Влады́к', \
'влⷣц' : 'влады́ц', \
'Влⷣц' : 'Влады́ц', \
'влⷣч' : 'влады́ч', \
'Влⷣч' : 'Влады́ч', \
'кр҃с' : 'кре́с', \
'кр҃л' : 'кре́сл', \
'кр҃ш' : 'креш', \
'крⷭ҇и' : 'креси', \
'крⷭ҇' : 'кре́с', \
'гдⷭ҇а' : 'Го́спода', \
'гдⷭ҇ви' : 'Го́сподеви', \
'гдⷭ҇е' : 'Го́споде', \
'гдⷭ҇и' : 'Го́споди', \
'Гдⷭ҇' : 'Го́спод', \
'гдⷭ҇и́н' : 'господи́н', \
'гдⷭ҇и' : 'Го́споди', \
'гдⷭ҇к' : 'госпо́дск', \
'гдⷭ҇н' : 'госпо́дн', \
'гдⷭ҇нь' : 'госпо́день', \
'гдⷭ҇о' : 'господо', \
'гдⷭ҇р' : 'госуда́р', \
'гдⷭ҇с' : 'госпо́дс', \
'гдⷭ҇ꙋ' + eow : r'Го́сподꙋ\1', \
'гдⷭ҇ь' + eow : r'Госпо́дь\1', \
'гдⷭ҇ь' : 'госпо́дь', \
'гдⷭ҇ѣ' : 'Го́сподѣ', \
'глаⷡ҇' : 'глава̀', \
'гл҃а' : 'глаго́ла', \
'Гл҃а' : 'Глаго́ла', \
'гл҃г' : 'глаг', \
'Гл҃г' : 'Глаг', \
'гл҃е' : 'глаго́ле', \
'Гл҃е' : 'Глаго́ле', \
'гл҃и' : 'глаго́ли', \
'Гл҃и' : 'Глаго́ли', \
'гл҃ꙋ' : 'глаго́лꙋ', \
'Гл҃ꙋ' : 'Глаго́лꙋ', \
'гл҃ъ' : 'глаго́лъ', \
'Гл҃ъ' : 'Глаго́лъ', \
'гл҃ю' : 'глаго́лю', \
'Гл҃ю' : 'Глаго́лю', \
'гл҃ѧ' : 'глаго́лѧ', \
'Гл҃ѧ' : 'Глаго́лѧ', \
'глⷡ҇а' : 'глава̀', \
'Глⷡ҇а' : 'Глава̀', \
'гпⷭ҇ж' : 'госпож', \
'Гпⷭ҇ж' : 'Госпож', \
'дваⷤ' : 'два́жды', \
'Дваⷤ' : 'Два́жды', \
eow + 'дв҃а' : r'\1Дѣ́ва', \
'дв҃а' : 'дѣ́ва', \
'дв҃д' : 'Дави́д', \
'Дв҃д' : 'Дави́д', \
'дв҃и́' : 'дѣви́', \
'дв҃и̑' : 'дѣви̑', \
eow + 'дв҃о' : r'\1Дѣ́во', \
'дв҃о' : 'дѣ́во', \
'дв҃ы' : 'дѣ́вы', \
'дв҃с' : 'дѣ́вс', \
eow + 'дв҃ꙋ' : r'\1Дѣ́вꙋ', \
'дв҃ꙋ' : 'дѣ́вꙋ', \
'дв҃ц' : 'дѣ́виц', \
'дв҃ч' : 'дѣви́ч', \
eow + 'дв҃ы' : r'\1Дѣ́вы', \
'дв҃ы' : 'дѣ́вы', \
eow + 'дв҃ѣ' : r'\1Дѣ́вѣ', \
'дв҃ѣ' : 'дѣ́вѣ', \
'двⷭ҇т' : 'дѣ́вст', \
'Дв҃' : 'Дѣ́в', \
'дс҃ѣ' : 'ду́сѣ', \
'Дс҃' : 'Ду́с', \
'дх҃а' : 'ду́ха', \
'дх҃и' : 'ду́хи', \
'дх҃н' : 'духн', \
'дх҃о' : 'духо', \
'дх҃ѡ' : 'духѡ', \
'дх҃ꙋ' : 'ду́хꙋ', \
'дх҃ъ' : 'ду́хъ', \
'дх҃ѣ' : 'ду́хѣ', \
'Дх҃' : 'Ду́х', \
'дш҃а' : 'душа', \
'дш҃е' + eow : r'ду́ше\1', \
'дш҃е' : 'душе', \
'дш҃и' : 'души', \
'дш҃ꙋ' : 'ду́шꙋ', \
'дш҃ы' : 'ду́шы', \
'Дш҃' : 'Душ', \
'ѵⷢ҇л' : 'ѵа́нгел', \
'заⷱ҇' : 'зача́ло', \
'Заⷱ҇' : 'Зача́ло', \
'мⷬ҇к' : 'мѧрѣ́к', \
'рⷭ҇л' : 'русал', \
'і҆и҃л' : 'І҆сра́ил', \
'і҆и҃с' : 'І҆исꙋ́с', \
'кн҃г' : 'кнѧг', \
'кн҃же' + eow : r'кнѧ́же\1', \
'кн҃ж' : 'кнѧж', \
'кн҃з' : 'кнѧ́з', \
'Кн҃' : 'Кнѧ́', \
'кр҃с' : 'крес', \
'кр҃щ' : 'крещ', \
'крⷭ҇т' : 'крест', \
'Крⷭ҇т' : 'Крест', \
'мл҃т' : 'моли́т', \
'Мл҃т' : 'Моли́т', \
'млⷣн' : 'младе́н', \
'Млⷣн' : 'Младе́н', \
'млⷭ҇р' : 'милосѣ́р', \
'Млⷭ҇р' : 'Милосѣ́р', \
'млⷭ҇т' : 'ми́лост', \
'Млⷭ҇т' : 'Ми́лост', \
'мнⷭ҇т' : 'монаст', \
'Мнⷭ҇т' : 'Монаст', \
'мр҃і' : 'Марі', \
'мр҃ї' : 'Марї', \
'Мр҃і' : 'Марі', \
'Мр҃ї' : 'Марї', \
'мт҃е' : 'ма́те', \
eow + 'мт҃и' : r'\1Ма́ти', \
'мт҃и' : 'ма́ти', \
'мт҃р' : 'ма́тер', \
'мт҃ь' : 'ма́ть', \
'Мт҃' : 'Ма́т', \
'мцⷭ҇' : 'мѣ́сѧц', \
'Мцⷭ҇' : 'Мѣ́сѧц', \
'мч҃е' : 'му́че', \
'Мч҃е' : 'Му́че', \
'мч҃є' : 'му́чє', \
'Мч҃є' : 'Му́чє', \
'мч҃н' : 'му́чен', \
'Мч҃н' : 'Му́чен', \
'мчⷭ҇н' : 'мѣ́сѧчн', \
'м҃-ц' : 'четыредесѧ́тниц', \
'мⷭ҇ц' : 'мѣ́сѧц', \
'Мⷭ҇ц' : 'Мѣ́сѧц', \
'мⷭ҇ч' : 'мѣ́сѧч', \
'Мⷭ҇ч' : 'Mѣ́сѧч', \
'нб҃а' : 'не́ба', \
'нб҃е' : 'небе', \
'нб҃о' : 'не́бо', \
'нб҃с' : 'небе́с', \
'нб҃ꙋ' : 'не́бꙋ', \
'нб҃ѣ' : 'не́бѣ', \
'Нб҃' : 'Не́б', \
'нбⷭ҇н' : 'небе́сн', \
'Нбⷭ҇н' : 'Небе́сн', \
'нлⷣ' : 'недѣ́л', \
'Нлⷣ' : 'Недѣ́л', \
'нн҃ѣ' : 'ны́нѣ', \
'Нн҃ѣ' : 'Ны́нѣ', \
'ѻ҆ц҃а̀' : 'ѻ҆тца̀', \
'Ѻ҆ц҃а̀' : 'Ѻ҆тца̀', \
'ѻ҆ц҃а́' : 'ѻ҆тца́', \
'Ѻ҆ц҃а́' : 'Ѻ҆тца́', \
'ѻ҆ц҃е́' : 'ѻ҆тце́', \
'ѻ҆ц҃е́' : 'ѻ҆тце́', \
'Ѻ҆ц҃е́' : 'Ѻ҆тце́', \
'ѻ҆ц҃ꙋ̀' : 'ѻ҆тцꙋ̀', \
'Ѻ҆ц҃ꙋ̀' : 'Ѻ҆тцꙋ̀', \
'ѻ҆ц҃ꙋ́' : 'ѻ҆тцꙋ́', \
'Ѻ҆ц҃ꙋ́' : 'Ѻ҆тцꙋ́', \
'ѻ҆ц҃ъ' : 'ѻ҆те́цъ', \
'Ѻ҆ц҃ъ' : 'Ѻ҆те́цъ', \
'ѻ҆ц҃ы̀' : 'ѻ҆тцы̀', \
'Ѻ҆ц҃ы̀' : 'Ѻ҆тцы̀', \
'ѻ҆ц҃ѣ̀' : 'ѻ҆тцѣ̀', \
'Ѻ҆ц҃ѣ̀' : 'Ѻ҆тцѣ̀', \
'ѻ҆ч҃ес' : 'ѻ҆те́чес', \
'Ѻ҆ч҃ес' : 'Ѻ҆те́чес', \
'ѻ҆ч҃єс' : 'ѻ҆те́чєс', \
'Ѻ҆ч҃єс' : 'Ѻ҆те́чєс', \
'ѻ҆ч҃е' : 'ѻ҆́тче', \
'Ѻ҆ч҃е' : 'Ѻ҆тче', \
'ѻ҆ч҃с' : 'ѻ҆те́чес', \
'Ѻ҆ч҃с' : 'Ѻ҆те́чес', \
'ѻ҆ч҃ь' : 'ѻ҆те́чь', \
'Ѻ҆ч҃ь' : 'Ѻ҆те́чь', \
'ѻ҆́ч҃а' : 'ѻ҆́тча', \
'Ѻ҆́ч҃а' : 'Ѻ҆́тча', \
'ѻ҆́ч҃ес' : 'ѻ҆́течес', \
'Ѻ҆́ч҃ес' : 'Ѻ҆́течес', \
'ѻ҆́ч҃е' : 'ѻ҆́тче', \
'Ѻ҆́ч҃е' : 'Ѻ҆́тче', \
'Ѻ҆́ч҃е' : 'Ѻ҆́тче', \
'ѻ҆́ч҃и' : 'ѻ҆́тчи', \
'Ѻ҆́ч҃и' : 'Ѻ҆́тчи', \
'ѻ҆́ч҃ї' : 'ѻ҆́тчї', \
'Ѻ҆́ч҃ї' : 'Ѻ҆́тчї', \
'ѻ҆́ч҃ꙋ' : 'ѻ҆́тчꙋ', \
'Ѻ҆́ч҃ꙋ' : 'Ѻ҆́тчꙋ', \
'ѻ҆́ч҃ь' : 'ѻ҆́течь', \
'Ѻ҆́ч҃ь' : 'Ѻ҆́течь', \
'ѡⷮ' : 'ѿ', \
'ѡ҆сщ҃а́' : 'ѡ҆свѧща́', \
'Ѡ҆сщ҃а́' : 'Ѡ҆свѧща́', \
'ѡ҆чⷭ҇т' : 'ѡ҆чи́ст', \
'Ѡ҆чⷭ҇т' : 'Ѡ҆чи́ст', \
'ѻц҃а' : 'ѻтца', \
'Ѻц҃а' : 'Ѻтца', \
'ѻц҃є' : 'ѻтцє', \
'ѻ҆ц҃є́' : 'ѻ҆тцє́', \
'Ѻц҃є' : 'Ѻтцє', \
'ѻц҃ꙋ' : 'ѻтцꙋ', \
'Ѻц҃ꙋ' : 'Ѻтцꙋ', \
'ѻц҃ъ' : 'ѻтецъ', \
'Ѻц҃ъ' : 'Ѻтецъ', \
'ѻц҃ы' : 'ѻтцы', \
'Ѻц҃ы' : 'Ѻтцы', \
'ѻц҃ѣ' : 'ѻтцѣ', \
'Ѻц҃ѣ' : 'Ѻтцѣ', \
'ѻч҃е' : 'ѻтече', \
'Ѻч҃е' : 'Ѻтече', \
'ѻч҃є' : 'ѻтечє', \
'Ѻч҃є' : 'Ѻтечє', \
'ѻч҃и' : 'ѻтчи', \
'Ѻч҃и' : 'Ѻтчи', \
'ѻч҃ї' : 'ѻтчї', \
'Ѻч҃ї' : 'Ѻтчї', \
'ѻц҃ъ' : 'ѻтецъ', \
'Ѻц҃ъ' : 'Ѻтецъ', \
'пл҃т' : 'пло́т', \
'Пл҃т' : 'Пло́т', \
'поⷣ' : 'подо́бенъ', \
'Поⷣ' : 'Подо́бенъ', \
'првⷣ' : 'пра́вед', \
'Првⷣ' : 'Пра́вед', \
'пречⷭ҇т' : 'пречи́ст', \
'Пречⷭ҇т' : 'Пречи́ст', \
'мⷣр' : 'му́др', \
'прпⷣб' : 'преподо́б', \
'Прпⷣб' : 'Преподо́б', \
'пⷣб' : 'подо́б', \
'прпⷣн' : 'преподо́бн', \
'Прпⷣн' : 'Преподо́бн', \
'прⷣт' : 'предт', \
'Прⷣт' : 'Предт', \
'прⷪ҇рк' : 'проро́к', \
'Прⷪ҇рк' : 'Проро́к', \
'прⷪ҇р' : 'прор', \
'Прⷪ҇р' : 'Прор', \
'прⷭ҇н' : 'присн', \
'Прⷭ҇н' : 'Присн', \
'прⷭ҇т' : 'прест', \
'Прⷭ҇т' : 'Прест', \
'пѧⷦ҇' : 'пѧто́къ', \
'Пѧⷦ҇' : 'Пѧто́къ', \
'ржⷭ҇т' : 'рождест', \
'Ржⷭ҇т' : 'Рождест', \
'рожⷭ҇т' : 'рождест', \
'Рожⷭ҇т' : 'Рождест', \
'сл҃н' : 'со́лн', \
'Сл҃н' : 'Со́лн', \
'см҃рт' : 'сме́рт', \
'См҃рт' : 'Сме́рт', \
'сн҃а' : 'сы́на', \
'Сн҃а' : 'Сы́на', \
'сн҃е' : 'сы́не', \
'Сн҃е' : 'Сы́не', \
'сн҃є' : 'сы́нє', \
'Сн҃є' : 'Сы́нє', \
'сн҃о' : 'сыно', \
'Сн҃о' : 'Сыно', \
'сн҃ѡ' : 'сынѡ', \
'Сн҃ѡ' : 'Сынѡ', \
'сн҃ꙋ' : 'сы́нꙋ', \
'Сн҃ꙋ' : 'Сы́нꙋ', \
'сн҃ъ' : 'сы́нъ', \
'Сн҃ъ' : 'Сы́нъ', \
'сн҃ы' : 'сы́ны', \
'Сн҃ы' : 'Сы́ны', \
'сн҃ѣ' : 'сы́нѣ', \
'Сн҃ѣ' : 'Сы́нѣ', \
'сп҃са' + eow : r'Cпа́са\1', \
'сп҃са' : 'спаса', \
'сп҃се' : 'Cпа́се', \
'сп҃сѐ' : 'спасѐ', \
'сп҃се́' : 'спасе́', \
'сп҃сє́' : 'спасє́', \
'сп҃си' : 'спаси', \
'сп҃сл' : 'спасл', \
'сп҃со' : 'спасо', \
'сп҃сѡ' : 'спасѡ', \
'сп҃сс' : 'спа́сс', \
'сп҃ст' : 'спаст', \
'сп҃сꙋ' : 'спасꙋ', \
'сп҃сш' : 'спа́сш', \
'сп҃съ' : 'Спа́съ', \
'сп҃сы' : 'спасы', \
'сп҃сѣ' : 'спа́сѣ', \
'Сп҃с' : 'Спас', \
'спⷭ҇л' : 'спа́сл', \
'Cпⷭ҇л' : 'Cпа́сл', \
'спⷭ҇н' : 'спасе́н', \
'Cпⷭ҇н' : 'Cпасе́н', \
'спⷭ҇т' : 'спаст', \
'Cпⷭ҇т' : 'Cпаст', \
'спⷭ҇ш' : 'спа́сш', \
'Cпⷭ҇ш' : 'Cпа́сш', \
'срⷣц' : 'се́рдц', \
'Срⷣц' : 'Се́рдц', \
'стрⷭ҇ти' : 'стра́сти', \
'стрⷭ҇тї' : 'стра́стї', \
'стрⷭ҇ть' : 'стра́сть', \
'стрⷭ҇т' : 'страст', \
'Стрⷭ҇т' : 'Стра́ст', \
'ст҃а' + eow : r'свѧ́та\1', \
'ст҃а' : 'свѧта', \
'ст҃е' : 'свѧ́те', \
'ст҃и' : 'свѧти', \
'ст҃і' : 'свѧті', \
'ст҃л' : 'свѧти́тел', \
'ст҃о' : 'свѧ́то', \
'ст҃ѡ' : 'свѧ́тѡ', \
'ст҃ꙋ' : 'свѧ́тꙋ', \
'ст҃ъ' : 'свѧ́тъ', \
'ст҃ы' : 'свѧты', \
'ст҃ѣ' : 'свѧтѣ', \
'ст҃ѧ' : 'свѧтѧ', \
'Ст҃' : 'Свѧт', \
'сꙋⷠ҇' : 'сꙋббо́та', \
'Cꙋⷠ҇' : 'Cꙋббо́та', \
'сщ҃е' : 'свѧще', \
'сщ҃а' : 'свѧща', \
'сщ҃є' : 'свѧщє', \
'сщ҃ꙋ' : 'свѧщꙋ', \
'Сщ҃' : 'Свѧщ', \
'сⷯ' : 'сти́хъ', \
'трⷪ҇ц' : 'Тро́иц', \
'Трⷪ҇ц' : 'Тро́иц', \
'трⷪ҇ч' : 'тро́ич', \
'Трⷪ҇ч' : 'Тро́ич', \
'трⷭ҇т' : 'трисвѧт', \
'Трⷭ҇т' : 'Трисвѧт', \
'триⷤ' : 'три́жды', \
'Триⷤ' : 'Три́жды', \
'у҆чн҃и' : 'у҆чени', \
'Оу҆ч҃ни' : 'Оу҆чени', \
'у҆ч҃ни' : 'у҆чени', \
'Оу҆ч҃н' : 'Оу҆чен', \
'у҆ч҃н' : 'у҆чен', \
'Оу҆чн҃к' : 'Оу҆ченик', \
'у҆чн҃к' : 'у҆ченик', \
'Оу҆чн҃ц' : 'Оу҆чениц', \
'у҆чн҃ц' : 'у҆чениц', \
'Оу҆чт҃л' : 'Оу҆чи́тел', \
'у҆чт҃л' : 'у҆чи́тел', \
'Оу҆ч҃нї' : 'Оу҆че́нї', \
'у҆ч҃нї' : 'у҆че́нї', \
'Оу҆ч҃те' : 'Оу҆чи́те', \
'у҆ч҃те' : 'у҆чи́те', \
'Оу҆ч҃тл' : 'Оу҆чите́л', \
'у҆ч҃тл' : 'у҆чите́л', \
'хрⷭ҇т' : 'Христ', \
'Хрⷭ҇т' : 'Христ', \
'х҃с' : 'Христо́съ', \
'цр҃е' : 'царе', \
'Цр҃е' : 'Царе', \
'цр҃є' : 'царє', \
'Цр҃є' : 'Царє', \
'цр҃и' : 'цари', \
'Цр҃и' : 'Цари', \
'цр҃ї' : 'ца́рї', \
'Цр҃ї' : 'Ца́рї', \
'цр҃ква' : 'це́рква', \
'Цр҃ква' : 'Це́рква', \
'цр҃кве' : 'церкве́', \
'Цр҃кве' : 'Церкве́', \
'цр҃кви' : 'це́ркви', \
'Цр҃кви' : 'Це́ркви', \
'цр҃квь' : 'це́рковь', \
'Цр҃квь' : 'Це́рковь', \
'цр҃ков' : 'це́рков', \
'Цр҃ков' : 'Це́рков', \
'цр҃ко́в' : 'церко́в', \
'Цр҃ко́в' : 'Церко́в', \
'цр҃кѡ́в' : 'церкѡ́в', \
'Цр҃кѡ́в' : 'Церкѡ́в', \
'цр҃с' : 'ца́рс', \
'Цр҃с' : 'Ца́рс', \
'цр҃ц' : 'цари́ц', \
'Цр҃ц' : 'Цари́ц', \
'цр҃ь' : 'ца́рь', \
'Цр҃ь' : 'Ца́рь', \
'цр҃ѣ' : 'царѣ', \
'Цр҃ѣ' : 'Царѣ', \
'цр҃ю' : 'царю', \
'Цр҃ю' : 'Царю', \
'цр҃ѧ' : 'царѧ', \
'Цр҃ѧ' : 'Царѧ', \
'црⷭ҇к' : 'ца́рск', \
'Црⷭ҇к' : 'Ца́рск', \
'црⷭ҇т' : 'ца́рст', \
'Црⷭ҇т' : 'Ца́рст', \
'чеⷦ҇' : 'человѣ́къ', \
'Чеⷦ҇' : 'Человѣ́къ', \
'чл҃вѣ' : 'человѣ', \
'Чл҃вѣ' : 'Человѣ', \
'чл҃к' : 'человѣк', \
'Чл҃к' : 'Человѣк', \
'чтⷭ҇а' : 'чи́ста', \
'Чтⷭ҇а' : 'Чи́ста', \
'чтⷭ҇е' : 'че́сте', \
'Чтⷭ҇е' : 'Че́сте', \
'чтⷭ҇ї' : 'чи́стї', \
'Чтⷭ҇ї' : 'Чи́стї', \
'чтⷭ҇н' : 'че́стн', \
'Чтⷭ҇н' : 'Че́стн', \
'чтⷭ҇о' : 'чи́сто', \
'Чтⷭ҇о' : 'Чи́сто', \
'чтⷭ҇ꙋ' : 'чи́стꙋ', \
'Чтⷭ҇ꙋ' : 'Чи́стꙋ', \
'чтⷭ҇ъ' : 'чи́стъ', \
'Чтⷭ҇ъ' : 'Чи́стъ', \
'чтⷭ҇ы' : 'чи́сты', \
'Чтⷭ҇ы' : 'Чи́сты', \
'чтⷭ҇ь' : 'че́сть', \
'Чтⷭ҇ь' : 'Че́сть', \
'чтⷭ҇ѣ' : 'чи́стѣ', \
'Чтⷭ҇ѣ' : 'Чи́стѣ', \
'чⷭ҇та' : 'чи́ста', \
'Чⷭ҇та' : 'Чи́ста', \
'чⷭ҇те' : 'че́сте', \
'Чⷭ҇те' : 'Че́сте', \
'чⷭ҇тї' : 'чи́стї', \
'Чⷭ҇тї' : 'Чи́стї', \
'чⷭ҇тн' : 'че́стн', \
'Чⷭ҇тн' : 'Че́стн', \
'чⷭ҇то' : 'чи́сто', \
'Чⷭ҇то' : 'Чи́сто', \
'чⷭ҇тꙋ' : 'чи́стꙋ', \
'Чⷭ҇тꙋ' : 'Чи́стꙋ', \
'чⷭ҇ты' : 'чи́сты', \
'Чⷭ҇ты' : 'Чи́сты', \
'чⷭ҇тѣ' : 'чи́стѣ', \
'Чⷭ҇тѣ' : 'Чи́стѣ'
}



hip_untitlo = { \
"гг~л" : "нгел", \
"п\\\\сл" : "по'стол", \
"п\\\\стол" : "по'стол", \
"п\\\\стwл" : "по'стwл", \
"п\\\\скп" : "пи'скоп", \
"п\\\\скоп" : "пи'скоп", \
"гг~_ел" : "нг_ел", \
"бг~а" + eow : r"Бо'га\1", \
"бг~ови" + eow : r"Бо'гови\1", \
eow + "бг~ома'т" : r"\1Богома'т", \
eow + "бг~омлад" : r"\1Богомлад", \
eow + "бг~омт~" : r"\1Богома'т", \
"бг~ом" : "бо'гом", \
eow + "бг~оро'д" : r"\1Богоро'д", \
eow + "бг~у" + eow : r"\1Бо'г_у\2", \
eow + "бг~ъ" : r"\1Бо'гъ", \
"бг~" : "бог", \
"Бг~" : "Бог", \
eow + "бж~е" + eow : r"\1Бо'же\2", \
"бж~е" : "боже", \
"Бж~е" : "Боже", \
"бж~i" : "бо'жi", \
"Бж~i" : "Бо'жi", \
"бж\\\\ст" : "боже'ст", \
"Бж\\\\ст" : "Боже'ст", \
"бз~и" : "бози", \
"Бз~и" : "Бози", \
eow + "бз~jь" : r"\1Бозjь", \
"бз~jь" : "бозjь", \
"Бз~jь" : "Бозjь", \
"блг\\\\дт" : "благода'т", \
"Блг\\\\дт" : "Благода'т", \
"блг\\\\св" : "благослов", \
"Блг\\\\св" : "Благослов", \
eow + "бл~га" + eow : r"\1бла'га\2", \
eow + "бл~ги" + eow : r"\1бла'ги\2", \
eow + "бл~го" + eow : r"\1бла'го\2", \
eow + "бл~гъ" + eow : r"\1бла'гъ\2", \
"бл~г" : "благ", \
"Бл~г" : "Благ", \
"бл~ж" : "блаж", \
"Бл~ж" : "Блаж", \
"бл~з" : "блаз", \
"Бл~з" : "Блаз", \
eow + "бц\\\\д" : r"\1Богоро'диц", \
"бц\\\\д" : "богоро'диц", \
"Бц\\\\д" : "Богоро'диц", \
"бч\\\\д" : "богоро'дич", \
"Бч\\\\д" : "Богоро'дич", \
eow + "вл\\\\дк" : r"\1Влады'к", \
"вл\\\\дк" : "влады'к", \
"Вл\\\\дк" : "Влады'к", \
"вл\\\\дц" : "влады'ц", \
"Вл\\\\дц" : "Влады'ц", \
"вл\\\\дч" : "влады'ч", \
"Вл\\\\дч" : "Влады'ч", \
"кр~с" : "кре'с", \
"кр~л" : "кре'сл", \
"кр~ш" : "креш", \
"кр\\\\си" : "креси", \
"кр\\\\с" : "кре'с", \
"гд\\\\са" : "Го'спода", \
"гд\\\\сви" : "Го'сподеви", \
"гд\\\\се" : "Го'споде", \
"гд\\\\си" : "Го'споди", \
"Гд\\\\с" : "Го'спод", \
"гд\\\\си'н" : "господи'н", \
"гд\\\\си" : "Го'споди", \
"гд\\\\ск" : "госпо'дск", \
"гд\\\\сн" : "госпо'дн", \
"гд\\\\снь" : "госпо'день", \
"гд\\\\со" : "господо", \
"гд\\\\ср" : "гос_уда'р", \
"гд\\\\сс" : "госпо'дс", \
"гд\\\\су" + eow : r"Го'споду\1", \
"гд\\\\сь" + eow : r"Госпо'дь\1", \
"гд\\\\сь" : "госпо'дь", \
"гд\\\\сjь" : "Го'сподjь", \
"гла\\\\в" : "глава`", \
"гл~а" : "глаго'ла", \
"Гл~а" : "Глаго'ла", \
"гл~г" : "глаг", \
"Гл~г" : "Глаг", \
"гл~е" : "глаго'ле", \
"Гл~е" : "Глаго'ле", \
"гл~и" : "глаго'ли", \
"Гл~и" : "Глаго'ли", \
"гл~у" : "глаго'лу", \
"Гл~у" : "Глаго'лу", \
"гл~ъ" : "глаго'лъ", \
"Гл~ъ" : "Глаго'лъ", \
"гл~ю" : "глаго'лю", \
"Гл~ю" : "Глаго'лю", \
"гл~я" : "глаго'ля", \
"Гл~я" : "Глаго'ля", \
"гл\\\\ва" : "глава`", \
"Гл\\\\ва" : "Глава`", \
"гп\\\\сж" : "госпож", \
"Гп\\\\сж" : "Госпож", \
"два\\\\ж" : "два'жды", \
"Два\\\\ж" : "Два'жды", \
eow + "дв~а" : r"\1Дjь'ва", \
"дв~а" : "дjь'ва", \
"дв~д" : "Дави'д", \
"Дв~д" : "Дави'д", \
"дв~и'" : "дjьви'", \
"дв~и^" : "дjьви^", \
eow + "дв~о" : r"\1Дjь'во", \
"дв~о" : "дjь'во", \
"дв~ы" : "дjь'вы", \
"дв~с" : "дjь'вс", \
eow + "дв~у" : r"\1Дjь'ву", \
"дв~у" : "дjь'ву", \
"дв~ц" : "дjь'виц", \
"дв~ч" : "дjьви'ч", \
eow + "дв~ы" : r"\1Дjь'вы", \
"дв~ы" : "дjь'вы", \
eow + "дв~jь" : r"\1Дjь'вjь", \
"дв~jь" : "дjь'вjь", \
"дв\\\\ст" : "дjь'вст", \
"Дв~" : "Дjь'в", \
"дс~jь" : "д_у'сjь", \
"Дс~" : "Д_у'с", \
"дх~а" : "д_у'ха", \
"дх~и" : "д_у'хи", \
"дх~н" : "д_ухн", \
"дх~о" : "д_ухо", \
"дх~w" : "д_ухw", \
"дх~у" : "д_у'ху", \
"дх~ъ" : "д_у'хъ", \
"дх~jь" : "д_у'хjь", \
"Дх~" : "Д_у'х", \
"дш~а" : "д_уша", \
"дш~е" + eow : r"д_у'ше\1", \
"дш~е" : "д_уше", \
"дш~и" : "д_уши", \
"дш~у" : "д_у'шу", \
"дш~ы" : "д_у'шы", \
"Дш~" : "Д_уш", \
"v\\\\гл" : "vа'нгел", \
"за\\\\ч" : "зача'ло", \
"За\\\\ч" : "Зача'ло", \
"м\\\\рк" : "мярjь'к", \
"р\\\\сл" : "р_усал", \
"i=и~л" : "I=сра'ил", \
"i=и~с" : "I=ису'с", \
"кн~г" : "княг", \
"кн~же" + eow : r"кня'же\1", \
"кн~ж" : "княж", \
"кн~з" : "кня'з", \
"Кн~" : "Кня'", \
"кр~с" : "крес", \
"кр~щ" : "крещ", \
"кр\\\\ст" : "крест", \
"Кр\\\\ст" : "Крест", \
"мл~т" : "моли'т", \
"Мл~т" : "Моли'т", \
"мл\\\\дн" : "младе'н", \
"Мл\\\\дн" : "Младе'н", \
"мл\\\\ср" : "милосjь'р", \
"Мл\\\\ср" : "Милосjь'р", \
"мл\\\\ст" : "ми'лост", \
"Мл\\\\ст" : "Ми'лост", \
"мн\\\\ст" : "монаст", \
"Мн\\\\ст" : "Монаст", \
"мр~i" : "Марi", \
"мр~i" : "Марi", \
"Мр~i" : "Марi", \
"Мр~i" : "Марi", \
"мт~е" : "ма'те", \
eow + "мт~и" : r"\1Ма'ти", \
"мт~и" : "ма'ти", \
"мт~р" : "ма'тер", \
"мт~ь" : "ма'ть", \
"Мт~" : "Ма'т", \
"мц\\\\с" : "мjь'сяц", \
"Мц\\\\с" : "Мjь'сяц", \
"мч~е" : "м_у'че", \
"Мч~е" : "М_у'че", \
"мч~_е" : "м_у'ч_е", \
"Мч~_е" : "М_у'ч_е", \
"мч~н" : "м_у'чен", \
"Мч~н" : "М_у'чен", \
"мч\\\\сн" : "мjь'сячн", \
"м~-ц" : "четыредеся'тниц", \
"м\\\\сц" : "мjь'сяц", \
"М\\\\сц" : "Мjь'сяц", \
"м\\\\сч" : "мjь'сяч", \
"М\\\\сч" : "Mjь'сяч", \
"нб~а" : "не'ба", \
"нб~е" : "небе", \
"нб~о" : "не'бо", \
"нб~с" : "небе'с", \
"нб~у" : "не'бу", \
"нб~jь" : "не'бjь", \
"Нб~" : "Не'б", \
"нб\\\\сн" : "небе'сн", \
"Нб\\\\сн" : "Небе'сн", \
"нд\\\\л" : "недjь'л", \
"Нд\\\\л" : "недjь'л", \
"нл\\\\д" : "недjь'л", \
"Нл\\\\д" : "Недjь'л", \
"нн~jь" : "ны'нjь", \
"Нн~jь" : "Ны'нjь", \
"_о=ц~а`" : "_о=тца`", \
"_О=ц~а`" : "_О=тца`", \
"_о=ц~а'" : "_о=тца'", \
"_О=ц~а'" : "_О=тца'", \
"_о=ц~е'" : "_о=тце'", \
"_о=ц~е'" : "_о=тце'", \
"_О=ц~е'" : "_О=тце'", \
"_о=ц~у`" : "_о=тцу`", \
"_О=ц~у`" : "_О=тцу`", \
"_о=ц~у'" : "_о=тцу'", \
"_О=ц~у'" : "_О=тцу'", \
"_о=ц~ъ" : "_о=те'цъ", \
"_О=ц~ъ" : "_О=те'цъ", \
"_о=ц~ы`" : "_о=тцы`", \
"_О=ц~ы`" : "_О=тцы`", \
"_о=ц~jь`" : "_о=тцjь`", \
"_О=ц~jь`" : "_О=тцjь`", \
"_о=ч~ес" : "_о=те'чес", \
"_О=ч~ес" : "_О=те'чес", \
"_о=ч~_ес" : "_о=те'ч_ес", \
"_О=ч~_ес" : "_О=те'ч_ес", \
"_о=ч~е" : "_о='тче", \
"_О=ч~е" : "_О=тче", \
"_о=ч~с" : "_о=те'чес", \
"_О=ч~с" : "_О=те'чес", \
"_о=ч~ь" : "_о=те'чь", \
"_О=ч~ь" : "_О=те'чь", \
"_о='ч~а" : "_о='тча", \
"_О='ч~а" : "_О='тча", \
"_о='ч~ес" : "_о='течес", \
"_О='ч~ес" : "_О='течес", \
"_о='ч~е" : "_о='тче", \
"_О='ч~е" : "_О='тче", \
"_О='ч~е" : "_О='тче", \
"_о='ч~и" : "_о='тчи", \
"_О='ч~и" : "_О='тчи", \
"_о='ч~i" : "_о='тчi", \
"_О='ч~i" : "_О='тчi", \
"_о='ч~у" : "_о='тчу", \
"_О='ч~у" : "_О='тчу", \
"_о='ч~ь" : "_о='течь", \
"_О='ч~ь" : "_О='течь", \
"w=сщ~а'" : "w=свяща'", \
"W=сщ~а'" : "W=свяща'", \
"w=ч\\\\ст" : "w=чи'ст", \
"W=ч\\\\ст" : "W=чи'ст", \
"_оц~а" : "_отца", \
"_Оц~а" : "_Отца", \
"_оц~_е" : "_отц_е", \
"_о=ц~_е'" : "_о=тц_е'", \
"_Оц~_е" : "_Отц_е", \
"_оц~у" : "_отцу", \
"_Оц~у" : "_Отцу", \
"_оц~ъ" : "_отецъ", \
"_Оц~ъ" : "_Отецъ", \
"_оц~ы" : "_отцы", \
"_Оц~ы" : "_Отцы", \
"_оц~jь" : "_отцjь", \
"_Оц~jь" : "_Отцjь", \
"_оч~е" : "_отече", \
"_Оч~е" : "_Отече", \
"_оч~_е" : "_отеч_е", \
"_Оч~_е" : "_Отеч_е", \
"_оч~и" : "_отчи", \
"_Оч~и" : "_Отчи", \
"_оч~i" : "_отчi", \
"_Оч~i" : "_Отчi", \
"_оц~ъ" : "_отецъ", \
"_Оц~ъ" : "_Отецъ", \
"пл~т" : "пло'т", \
"Пл~т" : "Пло'т", \
"по\\\\д" : "подо'бенъ", \
"По\\\\д" : "Подо'бенъ", \
"прв\\\\д" : "пра'вед", \
"Прв\\\\д" : "Пра'вед", \
"преч\\\\ст" : "пречи'ст", \
"Преч\\\\ст" : "Пречи'ст", \
"м\\\\др" : "м_у'др", \
"прп\\\\дб" : "преподо'б", \
"Прп\\\\дб" : "Преподо'б", \
"п\\\\дб" : "подо'б", \
"прп\\\\дн" : "преподо'бн", \
"Прп\\\\дн" : "Преподо'бн", \
"пр\\\\дт" : "предт", \
"Пр\\\\дт" : "Предт", \
"пр\\\\орк" : "проро'к", \
"Пр\\\\орк" : "Проро'к", \
"пр\\\\ор" : "прор", \
"Пр\\\\ор" : "Прор", \
"пр\\\\сн" : "присн", \
"Пр\\\\сн" : "Присн", \
"пр\\\\ст" : "прест", \
"Пр\\\\ст" : "Прест", \
"пя\\\\к" : "пято'къ", \
"Пя\\\\к" : "Пято'къ", \
"рж\\\\дн" : "рожде'н", \
"рж\\\\ст" : "рождест", \
"Рж\\\\ст" : "Рождест", \
"рож\\\\ст" : "рождест", \
"Рож\\\\ст" : "Рождест", \
"сл~н" : "со'лн", \
"Сл~н" : "Со'лн", \
"см~рт" : "сме'рт", \
"См~рт" : "Сме'рт", \
"сн~а" : "сы'на", \
"Сн~а" : "Сы'на", \
"сн~е" : "сы'не", \
"Сн~е" : "Сы'не", \
"сн~_е" : "сы'н_е", \
"Сн~_е" : "Сы'н_е", \
"сн~о" : "сыно", \
"Сн~о" : "Сыно", \
"сн~w" : "сынw", \
"Сн~w" : "Сынw", \
"сн~у" : "сы'ну", \
"Сн~у" : "Сы'ну", \
"сн~ъ" : "сы'нъ", \
"Сн~ъ" : "Сы'нъ", \
"сн~ы" : "сы'ны", \
"Сн~ы" : "Сы'ны", \
"сн~jь" : "сы'нjь", \
"Сн~jь" : "Сы'нjь", \
"сп~са" + eow : r"Cпа'са\1", \
"сп~са" : "спаса", \
"сп~се" : "Cпа'се", \
"сп~се`" : "спасе`", \
"сп~се'" : "спасе'", \
"сп~с_е'" : "спас_е'", \
"сп~си" : "спаси", \
"сп~сл" : "спасл", \
"сп~со" : "спасо", \
"сп~сw" : "спасw", \
"сп~сс" : "спа'сс", \
"сп~ст" : "спаст", \
"сп~су" : "спасу", \
"сп~сш" : "спа'сш", \
"сп~съ" : "Спа'съ", \
"сп~сы" : "спасы", \
"сп~сjь" : "спа'сjь", \
"Сп~с" : "Спас", \
"сп\\\\сл" : "спа'сл", \
"Cп\\\\сл" : "Cпа'сл", \
"сп\\\\сн" : "спасе'н", \
"Cп\\\\сн" : "Cпасе'н", \
"сп\\\\ст" : "спаст", \
"Cп\\\\ст" : "Cпаст", \
"сп\\\\сш" : "спа'сш", \
"Cп\\\\сш" : "Cпа'сш", \
"ср\\\\дц" : "се'рдц", \
"Ср\\\\дц" : "Се'рдц", \
"стр\\\\сти" : "стра'сти", \
"стр\\\\стi" : "стра'стi", \
"стр\\\\сть" : "стра'сть", \
"стр\\\\ст" : "страст", \
"Стр\\\\ст" : "Стра'ст", \
"ст~а" + eow : r"свя'та\1", \
"ст~а" : "свята", \
"ст~е" : "свя'те", \
"ст~и" : "святи", \
"ст~i" : "святi", \
"ст~л" : "святи'тел", \
"ст~о" : "свя'то", \
"ст~w" : "свя'тw", \
"ст~у" : "свя'ту", \
"ст~ъ" : "свя'тъ", \
"ст~ы" : "святы", \
"ст~jь" : "святjь", \
"ст~я" : "святя", \
"Ст~" : "Свят", \
"су\\\\б" : "суббо'та", \
"Cу\\\\б" : "Cуббо'та", \
"сщ~е" : "свяще", \
"сщ~а" : "свяща", \
"сщ~_е" : "свящ_е", \
"сщ~у" : "свящу", \
"Сщ~" : "Свящ", \
"с\\\\х" : "сти'хъ", \
"тр\\\\оц" : "Тро'иц", \
"Тр\\\\оц" : "Тро'иц", \
"тр\\\\оч" : "тро'ич", \
"Тр\\\\оч" : "Тро'ич", \
"тр\\\\ст" : "трисвят", \
"Тр\\\\ст" : "Трисвят", \
"три\\\\ж" : "три'жды", \
"Три\\\\ж" : "Три'жды", \
"_у=чн~и" : "_у=чени", \
"О_у=ч~ни" : "О_у=чени", \
"_у=ч~ни" : "_у=чени", \
"О_у=ч~н" : "О_у=чен", \
"_у=ч~н" : "_у=чен", \
"О_у=чн~к" : "О_у=ченик", \
"_у=чн~к" : "_у=ченик", \
"О_у=чн~ц" : "О_у=чениц", \
"_у=чн~ц" : "_у=чениц", \
"О_у=чт~л" : "О_у=чи'тел", \
"_у=чт~л" : "_у=чи'тел", \
"О_у=ч~нi" : "О_у=че'нi", \
"_у=ч~нi" : "_у=че'нi", \
"О_у=ч~те" : "О_у=чи'те", \
"_у=ч~те" : "_у=чи'те", \
"О_у=ч~тл" : "О_у=чите'л", \
"_у=ч~тл" : "_у=чите'л", \
"хр\\\\ст" : "Христ", \
"Хр\\\\ст" : "Христ", \
"х~с" : "Христо'съ", \
"цр~е" : "царе", \
"Цр~е" : "Царе", \
"цр~_е" : "цар_е", \
"Цр~_е" : "Цар_е", \
"цр~и" : "цари", \
"Цр~и" : "Цари", \
"цр~i" : "ца'рi", \
"Цр~i" : "Ца'рi", \
"цр~ква" : "це'рква", \
"Цр~ква" : "Це'рква", \
"цр~кве" : "церкве'", \
"Цр~кве" : "Церкве'", \
"цр~кви" : "це'ркви", \
"Цр~кви" : "Це'ркви", \
"цр~квь" : "це'рковь", \
"Цр~квь" : "Це'рковь", \
"цр~ков" : "це'рков", \
"Цр~ков" : "Це'рков", \
"цр~ко'в" : "церко'в", \
"Цр~ко'в" : "Церко'в", \
"цр~кw'в" : "церкw'в", \
"Цр~кw'в" : "Церкw'в", \
"цр~с" : "ца'рс", \
"Цр~с" : "Ца'рс", \
"цр~ц" : "цари'ц", \
"Цр~ц" : "Цари'ц", \
"цр~ь" : "ца'рь", \
"Цр~ь" : "Ца'рь", \
"цр~jь" : "царjь", \
"Цр~jь" : "Царjь", \
"цр~ю" : "царю", \
"Цр~ю" : "Царю", \
"цр~я" : "царя", \
"Цр~я" : "Царя", \
"цр\\\\ск" : "ца'рск", \
"Цр\\\\ск" : "Ца'рск", \
"цр\\\\ст" : "ца'рст", \
"Цр\\\\ст" : "Ца'рст", \
"че\\\\к" : "человjь'къ", \
"Че\\\\к" : "Человjь'къ", \
"чл~вjь" : "человjь", \
"Чл~вjь" : "Человjь", \
"чл~к" : "человjьк", \
"Чл~к" : "Человjьк", \
"чт\\\\са" : "чи'ста", \
"Чт\\\\са" : "Чи'ста", \
"чт\\\\се" : "че'сте", \
"Чт\\\\се" : "Че'сте", \
"чт\\\\сi" : "чи'стi", \
"Чт\\\\сi" : "Чи'стi", \
"чт\\\\сн" : "че'стн", \
"Чт\\\\сн" : "Че'стн", \
"чт\\\\со" : "чи'сто", \
"Чт\\\\со" : "Чи'сто", \
"чт\\\\су" : "чи'сту", \
"Чт\\\\су" : "Чи'сту", \
"чт\\\\съ" : "чи'стъ", \
"Чт\\\\съ" : "Чи'стъ", \
"чт\\\\сы" : "чи'сты", \
"Чт\\\\сы" : "Чи'сты", \
"чт\\\\сь" : "че'сть", \
"Чт\\\\сь" : "Че'сть", \
"чт\\\\сjь" : "чи'стjь", \
"Чт\\\\сjь" : "Чи'стjь", \
"ч\\\\ста" : "чи'ста", \
"Ч\\\\ста" : "Чи'ста", \
"ч\\\\сте" : "че'сте", \
"Ч\\\\сте" : "Че'сте", \
"ч\\\\стi" : "чи'стi", \
"Ч\\\\стi" : "Чи'стi", \
"ч\\\\стн" : "че'стн", \
"Ч\\\\стн" : "Че'стн", \
"ч\\\\сто" : "чи'сто", \
"Ч\\\\сто" : "Чи'сто", \
"ч\\\\сту" : "чи'сту", \
"Ч\\\\сту" : "Чи'сту", \
"ч\\\\сты" : "чи'сты", \
"Ч\\\\сты" : "Чи'сты", \
"ч\\\\стjь" : "чи'стjь", \
"Ч\\\\стjь" : "Чи'стjь"
}


vowel_accent_regexp = '[' + chr(0x0300) + chr(0x0301) + chr(0x030F) + chr(0x0486) + ']'

# замены для перекодировки в гражданицу с ударениями (считаем, что титла заранее сняты)
accent_sign = chr(0x0301)

utf_grazhd_acc = { \
chr(0x0300) : accent_sign, \
chr(0x0301) : accent_sign, \
chr(0x0308) : '', \
chr(0x030F) : accent_sign, \
chr(0x0311) : accent_sign, \
chr(0x033E) : 'ъ', \
chr(0x0404) : 'Е', \
chr(0x0405) : 'З', \
chr(0x0406) : 'И', \
chr(0x041E) + chr(0x0443) : 'У', \
chr(0x0443) : 'у', \
chr(0x0450) : 'е', \
chr(0x0454) : 'е', \
chr(0x0455) : 'з', \
chr(0x0456) : 'и', \
chr(0x0457) : 'и', \
chr(0x045D) : 'и', \
chr(0x0460) : 'О', \
chr(0x0461) : 'о', \
chr(0x0462) : 'Е', \
chr(0x0463) : 'е', \
chr(0x0466) : 'Я', \
chr(0x0467) : 'я', \
chr(0x046E) : 'Кс', \
chr(0x046F) : 'кс', \
chr(0x0470) : 'Пс', \
chr(0x0471) : 'пс', \
chr(0x0472) : 'Ф', \
chr(0x0473) : 'ф', \
chr(0x0474) + vowel_accent_regexp : 'И' + accent_sign, \
chr(0x0474) : 'В', \
chr(0x0475) + vowel_accent_regexp : 'и' + accent_sign, \
chr(0x0475) : 'в', \
chr(0x0476) : 'И', \
chr(0x0477) : 'и', \
chr(0x00EF) : 'и', \
chr(0x047A) : 'О', \
chr(0x047B) : 'о', \
chr(0x047C) : 'О', \
chr(0x047D) : 'о', \
chr(0x047E) : 'От', \
chr(0x047F) : 'от', \
chr(0x0482) : '#', \
chr(0x0483) : '~', \
chr(0x0486) : '', \
chr(0x0487) : '^', \
chr(0x0488) : '<легион>', \
chr(0x0489) : '<леодр>', \
chr(0x1C81) : 'д', \
chr(0x1C82) : 'о', \
chr(0x1C82) + chr(0x0443) : 'у', \
chr(0x1C83) : 'с', \
chr(0x1C84) : 'т', \
chr(0x1C85) : 'т', \
chr(0x1C86) : 'ъ', \
chr(0x1C87) : 'е', \
chr(0x1C88) : 'у', \
chr(0x1F540) : '(+)', \
chr(0x1F541) : '\\\\+/', \
chr(0x1F542) : '+', \
chr(0x1F543) : '(:.', \
chr(0x1F544) : '.:)', \
chr(0x1F545) : 'Мр', \
chr(0x200B) : '', \
chr(0x200D) : '', \
chr(0x2013) : '—', \
chr(0x2020) : '+', \
chr(0x20DD) : '<тьма>', \
chr(0x2DE0) + chr(0x0487) : 'б', \
chr(0x2DE1) + chr(0x0487) : 'в', \
chr(0x2DE2) + chr(0x0487) : 'г', \
chr(0x2DE3) : "д", \
chr(0x2DE4) : 'ж', \
chr(0x2DE5) : 'з', \
chr(0x2DE6) + chr(0x0487) : 'к', \
chr(0x2DE7) + chr(0x0487) : 'л', \
chr(0x2DE8) : 'м', \
chr(0x2DE9) + chr(0x0487) : 'н', \
chr(0x2DEA) + chr(0x0487) : 'о', \
chr(0x2DEB) : 'п', \
chr(0x2DEC) + chr(0x0487) : 'р', \
chr(0x2DED) + chr(0x0487) : 'с', \
chr(0x2DEE) : 'т', \
chr(0x2DEF) : 'х', \
chr(0x2DF0) : 'ц', \
chr(0x2DF1) + chr(0x0487) : 'ч', \
chr(0x2DF2) + chr(0x0487) : 'ш', \
chr(0x2DF3) + chr(0x0487) : 'щ', \
chr(0x2DF4) + chr(0x0487) : 'ф', \
chr(0x2DF6) + chr(0x0487) : 'а', \
chr(0x2DF7) : 'е', \
chr(0x2DF8) : 'г', \
chr(0x2DF9) : 'у', \
chr(0x2DFA) : 'е', \
chr(0x2DFB) : 'ю', \
chr(0x2DFC) : 'я', \
chr(0x2DFD) : 'я', \
chr(0x2DFE) : 'я', \
chr(0x2DFF) : 'ю', \
chr(0xA641) : 'з', \
chr(0xA643) : 'з', \
chr(0xA645) : 'з', \
chr(0xA647) : 'и', \
chr(0xA649) : 'ч', \
chr(0xA64A) : 'У', \
chr(0xA64B) : 'у', \
chr(0xA64D) : 'о', \
chr(0xA651) : 'ы', \
chr(0xA652) : 'Е', \
chr(0xA653) : 'е', \
chr(0xA655) : 'ю', \
chr(0xA656) : 'Я', \
chr(0xA657) : 'я', \
chr(0xA659) : 'я', \
chr(0xA65B) : 'я', \
chr(0xA65F) : 'ы', \
chr(0xA662) : 'Д', \
chr(0xA663) : 'д', \
chr(0xA665) : 'л', \
chr(0xA669) : 'о', \
chr(0xA66B) : 'о', \
chr(0xA66D) : 'оо', \
chr(0xA670) : '<вран>', \
chr(0xA671) : '<колода>', \
chr(0xA673) : '\*', \
chr(0xA675) : 'и', \
chr(0xA67E) : '@', \
chr(0xA699) : 'оо', \
chr(0xA69B) : 'о', \
chr(0xA69E) + chr(0x0487) : 'ф', \
chr(0xF8FF) : 'и', \
chr(0xFFFD) : '???'
}

hip_grazhd_acc = { \
"'" : accent_sign, \
"`" : accent_sign, \
"=" : '', \
"\^" : accent_sign, \
'"' : '', \
'jь' : "е", \
'Jь' : "Е", \
'JЬ' : "Е", \
'<кс>' : 'кс', \
'<КС>' : 'Кс', \
'<Кс>' : 'Кс', \
'ju' : 'ю', \
'<е>' : 'е', \
'<Е>' : 'е', \
's' : 'з', \
'S' : 'З', \
'v"' : 'и', \
'V"' : 'И', \
"v'" : 'и' + accent_sign, \
"V'" : 'И' + accent_sign, \
"v`" : 'и' + accent_sign, \
"V`" : 'И' + accent_sign, \
"v\^" : 'и' + accent_sign, \
"V\^" : 'И' + accent_sign, \
'v' : 'в', \
'V' : 'В', \
'f' : 'ф', \
'F' : 'Ф', \
'u' : 'у', \
'<i>' : 'и', \
'_i' : 'и', \
"i" : 'и', \
"I" : 'И', \
'<i_>' : 'и', \
'<е>' : 'е', \
'_е' : 'е', \
'_Е' : 'Е', \
'<Е>' : 'Е', \
'_кс' : 'кс', \
'_КС' : 'Кс', \
'_Кс' : 'Кс', \
'<кс>' : 'кс', \
'<КС>' : 'Кс', \
'<Кс>' : 'Кс', \
'<о>' : 'о', \
'<О>' : 'о', \
'_о' : 'о', \
'_О' : 'о', \
'w\\\\т' : 'от', \
'W\\\\т' : 'От', \
'W\\\\Т' : 'От', \
'<w>' : 'о', \
'<W>' : 'О', \
'_w' : 'о', \
'_W' : 'О', \
'w' : 'о', \
'W' : 'О', \
'<пс>' : 'пс', \
'<ПС>' : 'Пс', \
'<Пс>' : 'Пс', \
'_пс' : 'пс', \
'_ПС' : 'Пс', \
'_Пс' : 'пс', \
'о<у>' : 'у', \
'о_у' : 'у', \
'О<у>' : 'У', \
'О_у' : 'У', \
'<у>' : 'у', \
'_у' : 'у', \
'у' : 'у', \
'У' : 'у', \
'jа' : 'я', \
'JА' : 'Я', \
'Jа' : 'Я', \
'<а>' : 'а', \
'<г>' : 'г', \
'<Г>' : 'Г', \
'<д>' : 'д', \
# '<дг>' : 'дг', \
# '<ДГ>' : 'Дг', \
# '<дж>' : 'Дж', \
# '<ДЖ>' : 'Дж', \
'jе' : 'е', \
'JЕ' : 'Е', \
'Jе' : 'Е', \
# 'jjь' : 'е', \
# 'JJЬ' : 'е', \
'<jь>' : 'е', \
'</jь>' : 'е', \
# '<sг>' : 'зг', \
'<s->' : 'з', \
'<s>' : 'з', \
'<з>' : 'з', \
# 'g' : 'г', \
'<лг>' : 'лг', \
'<нг>' : 'нг', \
'<оо>' : 'оо', \
'<о\+>' : 'о', \
'<о.о.>' : 'оо', \
'<о.>' : 'о', \
'<о:>' : 'о', \
'<о_>' : 'о', \
'<_w>' : 'о', \
'<с>' : 'с', \
'<т>' : 'т', \
'<\|т\|>' : 'т', \
'<оv>' : 'у', \
# '<ч>' : 'ч', \
# 'q' : 'ч', \
# '<ъ>' : 'ъ', \
# '<ы>' : 'ы', \
# '<ьi_>' : 'ы', \
# '<ъi_>' : 'ы', \
# '<ьи>' : 'ы', \
# '<ъи>' : 'ы', \
# '<ь\-i>' : 'ы', \
# '<ъ\-i>' : 'ы', \
# '<ь\-i_>' : 'ы', \
# '<ъ\-i_>' : 'ы', \
# '<ь\-и>' : 'ы', \
# '<ъ\-и>' : 'ы', \
# '<ю>' : 'ю', \
# 'ю@' : 'ю', \
# '<jа>' : 'я', \
# 'jя' : 'я', \
# '<яu>' : 'я', \
# '<я\.>' : 'я', \
# '<я>' : 'я', \
# '<я_>' : 'я', \
# '<u>' : 'ю', \
# '<ын>' : 'ын', \
# '~' : '~', \
# '\\\\ъ' : 'ъ', \
# '\\\\Ъ' : 'Ъ', \
# '\\\\б' : 'б', \
# '\\\\Б' : 'Б', \
# '\\\\в' : 'в', \
# '\\\\В' : 'В', \
# '\\\\г' : 'г', \
# '\\\\Г' : 'Г', \
# "\\\\д" : 'д', \
# '\\\\Д' : 'Д', \
# '\\\\ж' : 'ж', \
# '\\\\Ж' : 'Ж', \
# '\\\\з' : 'з', \
# '\\\\З' : 'З', \
# '\\\\к' : 'к', \
# '\\\\К' : 'К', \
# '\\\\л' : 'л', \
# '\\\\Л' : 'Л', \
# '\\\\м' : 'м', \
# '\\\\М' : 'М', \
# '\\\\н' : 'н', \
# '\\\\Н' : 'Н', \
# '\\\\о' : 'о', \
# '\\\\О' : 'О', \
# '\\\\п' : 'п', \
# '\\\\П' : 'П', \
# '\\\\р' : 'р', \
# '\\\\Р' : 'Р', \
# '\\\\с' : 'с', \
# '\\\\С' : 'С', \
# '\\\\т' : 'т', \
# '\\\\Т' : 'Т', \
# '\\\\х' : 'х', \
# '\\\\Х' : 'Х', \
# '\\\\ф' : 'ф', \
# '\\\\Ф' : 'Ф', \
# '\\\\ц' : 'ц', \
# '\\\\Ц' : 'Ц', \
# '\\\\ч' : 'ч', \
# '\\\\Ч' : 'Ч', \
# '\\\\ш' : 'ш', \
# '\\\\Ш' : 'Ш', \
# '\\\\щ' : 'щ', \
# '\\\\Щ' : 'Щ', \
# '\\\\f' : 'ф', \
# '\\\\F' : 'Ф', \
# '\\\\а' : 'а', \
# '\\\\А' : 'А', \
# '\\\\е' : 'е', \
# '\\\\Е' : 'Е', \
# '\\\\g' : 'г', \
# '\\\\G' : 'Г', \
# '\\\\у' : 'у', \
# '\\\\У' : 'У', \
# '\\\\jе' : 'е', \
# '\\\\ю' : 'ю', \
# '\\\\Ю' : 'Ю', \
# '\\\\jа' : 'я', \
# '\\\\я' : 'я', \
# '\\\\Я' : 'Я', \
# '\\\\u' : 'ю', \
# '\\\\U' : 'ю', \
# '\\\\ju' : 'ю', \
# '\\\\и' : 'и', \
# '\\\\И' : 'И', \
# '\\\\^' : '', \
# '\\\\-' : '', \
# '#' : '', \
# '@' : '', \
# '\+' : '', \
# '\*' : '', \
# '<\*>' : '', \
# '<М\\\\р>' : '', \
# '<\+>' : '', \
# '<\\\\\+/>' : '', \
# '<\(\+\)>' : '', \
# '<\(:\.>' : '', \
# '<\.:\)>' : '', \
# '<тьматем>' : '', \
# '<\->' : '', \
# '<тьма>&' : '', \
# '<легион>&' : '', \
# '<леодр>&' : '', \
# '<вран>&' : '', \
# '<колода>&' : '', \
# '<>' : '' + '', \
# '_/' : '' + '', \
'<_>' : ' ', \
'__' : ' ', \
'<\|>' : '', \
'&' : '', \
'%\-' : '', \
'<\(\(>' : '«', \
'<\)\)>' : '»'
}

# замены для перекодировки UTF в HIP
utf_hip = { \
chr(0x000A) + chr(0x000A) : '_/', \
chr(0x000A) + chr(0x000A) : '<>', \
chr(0x00AB) : '<\(\(>', \
chr(0x00AD) : '%-', \
chr(0x00BB) : '<\)\)>', \
chr(0x0300) : '`', \
chr(0x0301) : "'", \
chr(0x030F) : '"', \
chr(0x0311) : '^', \
chr(0x033E) : '\\\\ъ', \
chr(0x034F) : '<\|>', \
chr(0x0404) : '_Е', \
chr(0x0405) : 'S', \
chr(0x0406) : 'I', \
chr(0x040F) : '<ДЖ>', \
chr(0x041E) + chr(0x0443) : 'О_у', \
chr(0x0443) : '_у', \
chr(0x044A) + chr(0x0438) : '<ъи>', \
chr(0x044A) + chr(0xA647) : '<ъi_>', \
chr(0x044B) + chr(0xA672) : '<тьматем>', \
chr(0x044C) + chr(0x0438) : '<ьи>', \
chr(0x044C) + chr(0xA647) : '<ьi_>', \
chr(0x044E) + chr(0x0306) : 'ю@', \
chr(0x0454) : '_е', \
chr(0x0455) : 's', \
chr(0x0456) : 'i', \
chr(0x00EF) : 'i', \
chr(0x0457) : 'i', \
chr(0x045F) : '<дж>', \
chr(0x0460) : 'W', \
chr(0x0461) : 'w', \
chr(0x0462) : 'JЬ', \
chr(0x0463) : 'jь', \
chr(0x0464) : 'JЕ', \
chr(0x0465) : 'jе', \
chr(0x0466) : 'Я', \
chr(0x0467) : 'я', \
chr(0x0469) : 'jя', \
chr(0x046B) : 'u', \
chr(0x046D) : 'ju', \
chr(0x046E) : '_КС', \
chr(0x046F) : '_кс', \
chr(0x0470) : '_ПС', \
chr(0x0471) : '_пс', \
chr(0x0472) : 'F', \
chr(0x0473) : 'f', \
chr(0x0474) : 'V', \
chr(0x0475) : 'v', \
chr(0x0476) : 'V"', \
chr(0x0477) : 'v"', \
chr(0x047A) : '_О', \
chr(0x047B) : '_о', \
chr(0x047C) : '_W', \
chr(0x047D) : '_w', \
chr(0x047E) : 'W\\\\т', \
chr(0x047F) : 'w\\\\т', \
chr(0x0481) : 'q', \
chr(0x0482) : '#', \
chr(0x0483) : '~', \
chr(0x0486) : '=', \
chr(0x0487) : '\\\\^', \
chr(0x0488) : '<легион>&', \
chr(0x0489) : '<леодр>&', \
chr(0x0490) : '<Г>', \
chr(0x0491) : '<г>', \
chr(0x04A5) : '<нг>', \
chr(0x1C81) : '<д>', \
chr(0x1C82) : '<о_>', \
chr(0x1C82) + chr(0x0443) : 'о_у', \
chr(0x1C83) : '<с>', \
chr(0x1C84) : '<т>', \
chr(0x1C85) : '<|т|>', \
chr(0x1C86) : '<ъ>', \
chr(0x1C87) : '<jь>', \
chr(0x1C88) : '<оv>', \
chr(0x1F540) : '<(+)>', \
chr(0x1F541) : '<\+/>', \
chr(0x1F542) : '<+>', \
chr(0x1F543) : '<(:.>', \
chr(0x1F544) : '<.:)>', \
chr(0x1F545) : '<М\р>', \
chr(0x200B) : '<_>', \
chr(0x200D) : '&', \
chr(0x2013) : '<->', \
chr(0x2020) : '\+', \
chr(0x20DD) : '<тьма>&', \
chr(0x2DE0) + chr(0x0487) : '\\\\б', \
chr(0x2DE1) + chr(0x0487) : '\\\\в', \
chr(0x2DE2) + chr(0x0487) : '\\\\г', \
chr(0x2DE3) : "\\\\д", \
chr(0x2DE4) : '\\\\ж', \
chr(0x2DE5) : '\\\\з', \
chr(0x2DE6) + chr(0x0487) : '\\\\к', \
chr(0x2DE7) + chr(0x0487) : '\\\\л', \
chr(0x2DE8) : '\\\\м', \
chr(0x2DE9) + chr(0x0487) : '\\\\н', \
chr(0x2DEA) + chr(0x0487) : '\\\\о', \
chr(0x2DEB) : '\\\\п', \
chr(0x2DEC) + chr(0x0487) : '\\\\р', \
chr(0x2DED) + chr(0x0487) : '\\\\с', \
chr(0x2DEE) : '\\\\т', \
chr(0x2DEF) : '\\\\х', \
chr(0x2DF0) : '\\\\ц', \
chr(0x2DF1) + chr(0x0487) : '\\\\ч', \
chr(0x2DF2) + chr(0x0487) : '\\\\ш', \
chr(0x2DF3) + chr(0x0487) : '\\\\щ', \
chr(0x2DF4) + chr(0x0487) : '\\\\f', \
chr(0x2DF6) + chr(0x0487) : '\\\\а', \
chr(0x2DF7) : '\\\\е', \
chr(0x2DF8) : '\\\\g', \
chr(0x2DF9) : '\\\\у', \
chr(0x2DFA) : '\\\\jе', \
chr(0x2DFB) : '\\\\ю', \
chr(0x2DFC) : '\\\\jа', \
chr(0x2DFD) : '\\\\я', \
chr(0x2DFE) : '\\\\u', \
chr(0x2DFF) : '\\\\ju', \
chr(0xA641) : '<з>', \
chr(0xA643) : '<s->', \
chr(0xA645) : '<s>', \
chr(0xA647) : '<i_>', \
chr(0xA649) : 'g', \
chr(0xA64A) : 'У', \
chr(0xA64B) : 'у', \
chr(0xA64D) : '<_w>', \
chr(0xA651) : '<ы>', \
chr(0xA652) : 'JJЬ', \
chr(0xA653) : 'jjь', \
chr(0xA655) : '<ю>', \
chr(0xA656) : 'JА', \
chr(0xA657) : 'jа', \
chr(0xA659) : '<я>', \
chr(0xA65B) : '<яu>', \
chr(0xA65F) : '<ын>', \
chr(0xA662) : '<ДГ>', \
chr(0xA663) : '<дг>', \
chr(0xA665) : '<лг>', \
chr(0xA669) : '<о.>', \
chr(0xA66B) : '<о:>', \
chr(0xA66D) : '<о.о.>', \
chr(0xA670) : '<вран>&', \
chr(0xA671) : '<колода>&', \
chr(0xA673) : '\*', \
chr(0xA675) : '\\\\и', \
chr(0xA67E) : '@', \
chr(0xA699) : '<оо>', \
chr(0xA69B) : '<о\+>', \
chr(0xA69E) + chr(0x0487) : '\\\\ф', \
chr(0xF8FF) : '_i', \
chr(0xFFFD) : '\?\?\?'
}

hip_utf = { \
'A' : chr(0x0410), \
'a' : chr(0x0430), \
'B' : chr(0x0412), \
'b' : chr(0x0432), \
'E' : chr(0x0045), \
'e' : chr(0x0435), \
'K' : chr(0x041A), \
'k' : chr(0x043A), \
'M' : chr(0x041C), \
'm' : chr(0x043C), \
'H' : chr(0x041D), \
'h' : chr(0x043D), \
'O' : chr(0x041E), \
'o' : chr(0x043E), \
'P' : chr(0x0420), \
'p' : chr(0x0440), \
'C' : chr(0x0421), \
'c' : chr(0x0441), \
'T' : chr(0x0422), \
't' : chr(0x0442), \
'Y' : chr(0x0423), \
'y' : chr(0x0443), \
'X' : chr(0x0425), \
'x' : chr(0x0445), \
'І' : chr(0x0049), \
'і' : chr(0x0069), \
'jь' : chr(0x0463), \
'Jь' : chr(0x0462), \
'JЬ' : chr(0x0462), \
'<кс>' : chr(0x046F), \
'<КС>' : chr(0x046E), \
'<Кс>' : chr(0x046E), \
'ju' : chr(0x046D), \
'<е>' : chr(0x0454), \
'<Е>' : chr(0x0404), \
's' : chr(0x0455), \
'S' : chr(0x0405), \
'v"' : chr(0x0477), \
'V"' : chr(0x0476), \
'v' : chr(0x0475), \
'V' : chr(0x0474), \
'f' : chr(0x0473), \
'F' : chr(0x0472), \
'u' : chr(0x046B), \
'<i>' : chr(0x0456), \
'_i' : chr(0xF8FF), \
"i'" : chr(0x0456) + chr(0x0301), \
'i`' : chr(0x0456) + chr(0x0300), \
'i=' : chr(0x0456) + chr(0x0486), \
'i\^' : chr(0x0456) + chr(0x0311), \
'i' : chr(0x0456) + chr(0x0308), \
'<i_>' : chr(0xA647), \
'<е>' : chr(0x0454), \
'_е' : chr(0x0454), \
'_Е' : chr(0x0404), \
'<Е>' : chr(0x0404), \
'_кс' : chr(0x046F), \
'_КС' : chr(0x046E), \
'_Кс' : chr(0x046E), \
'<кс>' : chr(0x046F), \
'<КС>' : chr(0x046E), \
'<Кс>' : chr(0x046E), \
'<о>' : chr(0x047B), \
'<О>' : chr(0x047A), \
'_о' : chr(0x047B), \
'_О' : chr(0x047A), \
'w\\\\т' : chr(0x047F), \
'W\\\\т' : chr(0x047E), \
'W\\\\Т' : chr(0x047E), \
'<w>' : chr(0x047D), \
'<W>' : chr(0x047C), \
'_w' : chr(0x047D), \
'_W' : chr(0x047C), \
'w' : chr(0x0461), \
'W' : chr(0x0460), \
'<пс>' : chr(0x0471), \
'<ПС>' : chr(0x0470), \
'<Пс>' : chr(0x0470), \
'_пс' : chr(0x0471), \
'_ПС' : chr(0x0470), \
'_Пс' : chr(0x0470), \
'о<у>' : chr(0x1C82) + chr(0x0443), \
'о_у' : chr(0x1C82) + chr(0x0443), \
'О<у>' : chr(0x041E) + chr(0x0443), \
'О_у' : chr(0x041E) + chr(0x0443), \
'<у>' : chr(0x0443), \
'_у' : chr(0x0443), \
'у' : chr(0xA64B), \
'У' : chr(0xA64A), \
'jа' : chr(0xA657), \
'JА' : chr(0xA656), \
'Jа' : chr(0xA656), \
'я' : chr(0x0467), \
'Я' : chr(0x0466), \
'<а>' : chr(0xFFFD), \
'<г>' : chr(0x0491), \
'<Г>' : chr(0x0490), \
'<д>' : chr(0x1C81), \
'<дг>' : chr(0xA663), \
'<ДГ>' : chr(0xA662), \
'<дж>' : chr(0x045F), \
'<ДЖ>' : chr(0x040F), \
'jе' : chr(0x0465), \
'JЕ' : chr(0x0464), \
'Jе' : chr(0x0464), \
'jjь' : chr(0xA653), \
'JJЬ' : chr(0xA652), \
'<jь>' : chr(0x1C87), \
'</jь>' : chr(0xFFFD), \
'<sг>' : chr(0xA643), \
'<s->' : chr(0xA643), \
'<s>' : chr(0xA645), \
'<з>' : chr(0xA641), \
'g' : chr(0xA649), \
'<лг>' : chr(0xA665), \
'<нг>' : chr(0x04A5), \
'<оо>' : chr(0xA699), \
'<о\+>' : chr(0xA69B), \
'<о.о.>' : chr(0xA66D), \
'<о.>' : chr(0xA669), \
'<о:>' : chr(0xA66B), \
'<о_>' : chr(0x1C82), \
'<_w>' : chr(0xA64D), \
'<с>' : chr(0x1C83), \
'<т>' : chr(0x1C84), \
'<\|т\|>' : chr(0x1C85), \
'<оv>' : chr(0x1C88), \
'<ч>' : chr(0x0447), \
'q' : chr(0x0481), \
'<ъ>' : chr(0x1C86), \
'<ы>' : chr(0xA651), \
'<ьi_>' : chr(0x044C) + chr(0xA647), \
'<ъi_>' : chr(0x044A) + chr(0xA647), \
'<ьи>' : chr(0x044C) + chr(0x0438), \
'<ъи>' : chr(0x044A) + chr(0x0438), \
'<ь\-i>' : chr(0xFFFD), \
'<ъ\-i>' : chr(0xFFFD), \
'<ь\-i_>' : chr(0xFFFD), \
'<ъ\-i_>' : chr(0xFFFD), \
'<ь\-и>' : chr(0xFFFD), \
'<ъ\-и>' : chr(0xFFFD), \
'э' : chr(0x044D), \
'Э' : chr(0x042D), \
'<ю>' : chr(0xA655), \
'ю@' : chr(0x044E) + chr(0x0306), \
'I' : chr(0x0406), \
'<jа>' : chr(0xA657), \
'jя' : chr(0x0469), \
'<яu>' : chr(0xA65B), \
'<я\.>' : chr(0xFFFD), \
'<я>' : chr(0xA659), \
'<я_>' : chr(0xFFFD), \
'<u>' : chr(0xFFFD), \
'<ын>' : chr(0xA65F), \
'=' : chr(0x0486), \
"'" : chr(0x0301), \
'\^' : chr(0x0311), \
'`' : chr(0x0300), \
'~' : chr(0x0483), \
'"' : chr(0x030F), \
'\\\\ъ' : chr(0x033E), \
'\\\\Ъ' : chr(0x033E), \
'\\\\б' : chr(0x2DE0) + chr(0x0487), \
'\\\\Б' : chr(0x2DE0) + chr(0x0487), \
'\\\\в' : chr(0x2DE1) + chr(0x0487), \
'\\\\В' : chr(0x2DE1) + chr(0x0487), \
'\\\\г' : chr(0x2DE2) + chr(0x0487), \
'\\\\Г' : chr(0x2DE2) + chr(0x0487), \
"\\\\д" : chr(0x2DE3), \
'\\\\Д' : chr(0x2DE3), \
'\\\\ж' : chr(0x2DE4), \
'\\\\Ж' : chr(0x2DE4), \
'\\\\з' : chr(0x2DE5), \
'\\\\З' : chr(0x2DE5), \
'\\\\к' : chr(0x2DE6) + chr(0x0487), \
'\\\\К' : chr(0x2DE6) + chr(0x0487), \
'\\\\л' : chr(0x2DE7) + chr(0x0487), \
'\\\\Л' : chr(0x2DE7) + chr(0x0487), \
'\\\\м' : chr(0x2DE8), \
'\\\\М' : chr(0x2DE8), \
'\\\\н' : chr(0x2DE9) + chr(0x0487), \
'\\\\Н' : chr(0x2DE9) + chr(0x0487), \
'\\\\о' : chr(0x2DEA) + chr(0x0487), \
'\\\\О' : chr(0x2DEA) + chr(0x0487), \
'\\\\п' : chr(0x2DEB), \
'\\\\П' : chr(0x2DE8), \
'\\\\р' : chr(0x2DEC) + chr(0x0487), \
'\\\\Р' : chr(0x2DEC) + chr(0x0487), \
'\\\\с' : chr(0x2DED) + chr(0x0487), \
'\\\\С' : chr(0x2DED) + chr(0x0487), \
'\\\\т' : chr(0x2DEE), \
'\\\\Т' : chr(0x2DEE), \
'\\\\х' : chr(0x2DEF), \
'\\\\Х' : chr(0x2DEF), \
'\\\\ф' : chr(0xA69E) + chr(0x0487), \
'\\\\Ф' : chr(0xA69E) + chr(0x0487), \
'\\\\ц' : chr(0x2DF0), \
'\\\\Ц' : chr(0x2DF0), \
'\\\\ч' : chr(0x2DF1) + chr(0x0487), \
'\\\\Ч' : chr(0x2DF1) + chr(0x0487), \
'\\\\ш' : chr(0x2DF2) + chr(0x0487), \
'\\\\Ш' : chr(0x2DF2) + chr(0x0487), \
'\\\\щ' : chr(0x2DF3) + chr(0x0487), \
'\\\\Щ' : chr(0x2DF3) + chr(0x0487), \
'\\\\f' : chr(0x2DF4) + chr(0x0487), \
'\\\\F' : chr(0x2DF4) + chr(0x0487), \
'\\\\а' : chr(0x2DF6) + chr(0x0487), \
'\\\\А' : chr(0x2DF6) + chr(0x0487), \
'\\\\е' : chr(0x2DF7), \
'\\\\Е' : chr(0x2DF7), \
'\\\\g' : chr(0x2DF8), \
'\\\\G' : chr(0x2DF8), \
'\\\\у' : chr(0x2DF9), \
'\\\\У' : chr(0x2DF9), \
'\\\\jе' : chr(0x2DFA), \
'\\\\ю' : chr(0x2DFB), \
'\\\\Ю' : chr(0x2DFB), \
'\\\\jа' : chr(0x2DFC), \
'\\\\я' : chr(0x2DFD), \
'\\\\Я' : chr(0x2DFD), \
'\\\\u' : chr(0x2DFE), \
'\\\\U' : chr(0x2DFE), \
'\\\\ju' : chr(0x2DFF), \
'\\\\и' : chr(0xA675), \
'\\\\И' : chr(0xA675), \
'\\\\^' : chr(0x0487), \
'\\\\-' : chr(0x0487), \
'#' : chr(0x0482), \
'@' : chr(0xA67E), \
'\+' : chr(0x2020), \
'\*' : chr(0xA673), \
'<\*>' : chr(0xA673), \
'<М\\\\р>' : chr(0x1F545), \
'<\+>' : chr(0x1F542), \
'<\\\\\+/>' : chr(0x1F541), \
'<\(\+\)>' : chr(0x1F540), \
'<\(:\.>' : chr(0x1F543), \
'<\.:\)>' : chr(0x1F544), \
'<тьматем>' : chr(0x044B) + chr(0xA672), \
'<\->' : chr(0x2013), \
'<тьма>&' : chr(0x20DD), \
'<легион>&' : chr(0x0488), \
'<леодр>&' : chr(0x0489), \
'<вран>&' : chr(0xA670), \
'<колода>&' : chr(0xA671), \
'<>' : chr(0x000A) + chr(0x000A), \
'_/' : chr(0x000A) + chr(0x000A), \
'<_>' : chr(0x200B), \
'__' : chr(0x200B), \
'<\|>' : chr(0x034F), \
'&' : chr(0x200D), \
'%\-' : chr(0x00AD), \
'<\(\(>' : chr(0x00AB), \
'<\)\)>' : chr(0x00BB)
}


# вставка спецсимвола перед каждым символом строки
# при этом команды типа \^ остаются неизменными
# а простые \ превращаются в \\
def sub_special_char(string, special_char):
    string = re.sub(r'(.)' , special_char + r'\1', string)
    for i in range(2):
        string = re.sub(r'(^|[^\\])' + special_char + '\\\\' + special_char + r'([\(\)\[\]\*\+\|\.0-9\^])', \
            r'\1' + special_char + r'\\\2', string, count = 0)
    for i in range(2):
        string = re.sub(special_char + '\\\\' + special_char, \
            special_char + '\\\\\\\\'  + special_char, string, count = 0)
    string = re.sub('\\\\' + special_char + '\\\\', \
            '\\\\\\\\', string, count = 0)
    return string


def sub_by_dictionary(string, dictionary):
    special_char = u'◦'
    string = sub_special_char(string, special_char)
    # print (string)
    # sort keys by length, in reverse order
    for item in sorted(dictionary.keys(), key = len, reverse = True):
        spec_item = sub_special_char(item, special_char)
        # print (item + ' : ' + spec_item)
        # s1 = string
        string = re.sub(spec_item, dictionary[item], string)
        # if s1 !=  string:
        #     print(item, string)
    string = re.sub(special_char, '', string)
    string = re.sub('\\\\\\\\', '\\\\', string)
    return string


def sub_by_dictionary_simple(string, dictionary):
    for item in dictionary.keys():
        string = re.sub(item, dictionary[item], string)
    return string

def sub_by_dictionary_sorted(string, dictionary):
    for item in sorted(dictionary.keys(), key = len, reverse = True):
        string = re.sub(item, dictionary[item], string)
    return string

def csl_transcode(string, from_enc, to_enc):
    if from_enc.lower() == 'hip':
        if to_enc.lower() == 'utf':
            return sub_by_dictionary(string, hip_utf)
        elif to_enc.lower() == 'grazhd-acc':
            # print(string)
            string = sub_by_dictionary_sorted(string, hip_untitlo)
            # print(string)
            string = sub_by_dictionary_sorted(string, hip_grazhd_acc)
            # print(string)
            string = re.sub(r'ъ' + eow, r'\1', string)
            return(string)
        elif to_enc.lower() == 'grazhd':
            string = csl_transcode(string, from_enc, 'grazhd-acc')
            string = re.sub(accent_sign, '', string)
            return(string)
    elif from_enc.lower() == 'utf':
        if to_enc.lower() == 'hip':
            return sub_by_dictionary(string, utf_hip)
        elif to_enc.lower() == 'grazhd-acc':
            string = sub_by_dictionary(string, utf_untitlo)
            string = sub_by_dictionary(string, utf_grazhd_acc)
            string = re.sub(r'ъ' + eow, r'\1', string)
            return(string)
        elif to_enc.lower() == 'grazhd':
            string = csl_transcode(string, from_enc, 'grazhd-acc')
            string = re.sub(accent_sign, '', string)
            return(string)
